src/QLDiemComApp/test/TestNhapDiem/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qld="QLDiemComApp" xmlns:loa="http://xml.netbeans.org/schema/LoaiDiem">
  <soapenv:Body>
    <qld:NhapDiemOperation>
      <listDiem>
        <!--Zero or more repetitions:-->
        <loa:Diem>
          <loa:id_diem>1</loa:id_diem>
          <loa:diem>9</loa:diem>
          <loa:id_loaidiem>1</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>2</loa:id_diem>
          <loa:diem>8</loa:diem>
          <loa:id_loaidiem>1</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>3</loa:id_diem>
          <loa:diem>7</loa:diem>
          <loa:id_loaidiem>1</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>4</loa:id_diem>
          <loa:diem>8</loa:diem>
          <loa:id_loaidiem>1</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>5</loa:id_diem>
          <loa:diem>7</loa:diem>
          <loa:id_loaidiem>2</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>6</loa:id_diem>
          <loa:diem>5</loa:diem>
          <loa:id_loaidiem>2</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>7</loa:id_diem>
          <loa:diem>9</loa:diem>
          <loa:id_loaidiem>2</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>8</loa:id_diem>
          <loa:diem>10</loa:diem>
          <loa:id_loaidiem>3</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>9</loa:id_diem>
          <loa:diem>6</loa:diem>
          <loa:id_loaidiem>3</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>10</loa:id_diem>
          <loa:diem>7</loa:diem>
          <loa:id_loaidiem>3</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>11</loa:id_diem>
          <loa:diem>9</loa:diem>
          <loa:id_loaidiem>3</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>12</loa:id_diem>
          <loa:diem>8</loa:diem>
          <loa:id_loaidiem>3</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>13</loa:id_diem>
          <loa:diem>9</loa:diem>
          <loa:id_loaidiem>4</loa:id_loaidiem>
          <loa:id_chitietsodiem>2</loa:id_chitietsodiem>
        </loa:Diem>
      </listDiem>
    </qld:NhapDiemOperation>
  </soapenv:Body>
</soapenv:Envelope>